tap "homebrew/cask"
tap "homebrew/cask-fonts"

cask "anydesk"                  # Remote Device Access
cask "authy"                    # TOTP MFA Helper
cask "docker"                   # Container Management
cask "spectacle"                # Shortcut Focused Window Management
cask "spotify"                  # Music, duh
cask "visual-studio-code"       # Extendable IDE
cask "vlc"                      # Open Source Video Player
cask "google-chrome"            # Browser
cask "slack"                    # Team communication and collaboration software
cask "1password"                # Password manager
cask "insomnia"                 # HTTP and GraphQL Client

brew "commitizen"   # Semantic Git commit messages
brew "gh"           # Github CLI
brew "nvm"          # Node.js version management
brew "yarn"         # JavaScript package manager

# Fonts
cask "font-fira-code"           # Font with ligatures