cask "anydesk"                  # Remote Device Access
cask "docker"                   # Container Management
cask "rectangle"                # Shortcut Focused Window Management (replaces spectacle)
cask "spotify"                  # Music, duh
cask "visual-studio-code"       # Extendable IDE
cask "vlc"                      # Open Source Video Player
cask "google-chrome"            # Browser
cask "slack"                    # Team communication and collaboration software
cask "1password"                # Password manager
cask "bruno"                    # HTTP and GraphQL Client (open source, replaces insomnia)
cask "notion"                   # Note taking and collaboration
cask "medis"                    # Redis GUI
cask "cmux"                     # TMUX session manager
cask "dbeaver-community"        # Database Management
cask "claude-code"              # AI assistant for developers
cask "libomp"                   # LLVM's OpenMP runtime library
cask "r"                        # R programming language
cask "xquartz"                  # X11 server for macOS

brew "commitizen"               # Semantic Git commit messages
brew "gh"                       # Github CLI
brew "git"                      # Version control (latest)
brew "nvm"                      # Node.js version management
brew "yarn"                     # JavaScript package manager
brew "pnpm"                     # Fast, disk-efficient package manager
brew "asdf"                     # Multi-language version manager
brew "aws-vault"                # AWS credentials manager
brew "direnv"                   # Per-directory environment variables
brew "tmux"                     # Terminal multiplexer (required by cmux)
brew "fzf"                      # Fuzzy finder
brew "watchman"                 # File watcher
brew "jq"                       # JSON processor
brew "ripgrep"                  # Fast grep

# Fonts
tap "homebrew/cask-fonts"
cask "font-fira-code"           # Font with ligatures
